<%@page pageEncoding="UTF-8"%>
<%@ include file="/init/templete/game_head.jsp"%>
<%@page import="com.ls.pub.constant.Channel" %>
★会员特权★<br/>
<%if(GameConfig.getChannelId() == Channel.AIR){
%>
乾坤会员是豪侠江湖尊贵的象征，是每个江湖中人梦寐以求的称号。称号的背后更有着常人无法领略的贵族享受。<br/>
乾坤会员非常6+1的尊贵特权：<br/>
1.四大属性超强提升：气血提高10%，攻击提高8%，防御提高8%，暴击提高5%<br/>
2.每天可上线领取188两银子<br/>
3.商城消费8.8折<br/>
4.不定期的会员专属活动<br/>
5.获得“会员”的特别称号<br/>
6.优先获得游戏体验及官方信息；<br/>
特别：可进入上层“积分商城”，全场8.8折扣，感受上流社会的华丽气息。<br/>
--------------------<br/>
无双会员非常6+1的尊贵特权：<br/>
1.四大属性极强提升：气血提高20%，攻击提高18%，防御提高18%，暴击提高8%<br/>
2.每天可上线领取388两银子<br/>
3.商城消费7.5折<br/>
4.不定期的会员专属活动<br/>
5.获得“贵宾”的特别称号<br/>
6.优先获得游戏体验及官方信息；<br/>
特别：可进入上层“积分商城”，全场7.5折扣，感受其他会员的嫉妒眼光。<br/>
--------------------<br/>
独尊会员非常6+1的尊贵特权：<br/>
7.四大属性真龙提升：气血提高30%，攻击提高28%，防御提高28%，暴击提高15%<br/>
8.每天可上线领取888两银子<br/>
9.商城消费6折<br/>
10.不定期的会员专属活动<br/>
11.获得“帝王”的特别称号<br/>
12.优先获得游戏体验及官方信息；<br/><%
}else{
%>
铁血会员是铁血江湖尊贵的象征，是每个江湖中人梦寐以求的称号。称号的背后更有着常人无法领略的贵族享受。<br/>
铁血会员非常6+1的尊贵特权：<br/>
1.四大属性超强提升：气血提高10%，攻击提高8%，防御提高8%，暴击提高5%<br/>
2.每天可上线领取188两银子<br/>
3.商城消费8.8折<br/>
4.不定期的会员专属活动<br/>
5.获得“会员”的特别称号<br/>
6.优先获得游戏体验及官方信息；<br/>
特别：可进入上层“积分商城”，全场8.8折扣，感受上流社会的华丽气息。<br/>
--------------------<br/>
贵宾会员非常6+1的尊贵特权：<br/>
1.四大属性极强提升：气血提高20%，攻击提高18%，防御提高18%，暴击提高8%<br/>
2.每天可上线领取388两银子<br/>
3.商城消费7.5折<br/>
4.不定期的会员专属活动<br/>
5.获得“贵宾”的特别称号<br/>
6.优先获得游戏体验及官方信息；<br/>
特别：可进入上层“积分商城”，全场7.5折扣，感受其他会员的嫉妒眼光。<br/>
--------------------<br/>
帝王会员非常6+1的尊贵特权：<br/>
7.四大属性真龙提升：气血提高30%，攻击提高28%，防御提高28%，暴击提高15%<br/>
8.每天可上线领取888两银子<br/>
9.商城消费6折<br/>
10.不定期的会员专属活动<br/>
11.获得“帝王”的特别称号<br/>
12.优先获得游戏体验及官方信息；<br/><%	
}%>
特别：可进入上层“积分商城”，全场6折扣，帝王御驾天下，众雄跪拜。<br/>
<anchor><go href="<%=response.encodeURL(GameConfig.getContextPath()+request.getAttribute("return_url"))%>" method="get"></go>返回上一级</anchor><br/>
<%@ include file="/init/inc_mall/return_mall_main.jsp"%>
</p>
</card>
</wml>


		